class CategoryModel {
  bool isSelected;
  String imagePath;
  String categoryName;
  String description;
  CategoryModel({required this.isSelected, required this.description, required this.imagePath, required this.categoryName});
  void _unSelectAll() {
    for (var category in categories) {
      category._unSelect();
    }
  }

  static String checkedCategory() {
    return categories.firstWhere((element) => element.isSelected).categoryName;
  }

  void select() {
    _unSelectAll();
    isSelected = true;
  }

  void _unSelect() {
    isSelected = false;
  }

  static List<CategoryModel> categories = [
    CategoryModel(
        isSelected: true,
        description: """ 
قبل بلوغ المريض عمر 6 أعوام، غالبًا ما تبدأ بعض المشكلات بالظهور على عضلات الأطراف السفلية، مما قد يتسبب في:
*     تأخر الطفل في المشي مقارنة بالأطفال الآخرين في عمره.
*     وقوع الطفل المتكرر عندما يبدأ بالمشي.
*     مواجهة الطفل نوعًا من الصعوبة عند محاولة صعود الدرج أو عند محاولة النهوض.
بعد ذلك قد يلاحظ أن الطفل بدأ يميل للمشي على أطراف أصابعه.
2. الأعراض اللاحقة 
مع نمو الطفل ومع مرور السنوات، قد تظهر الأعراض الإضافية الآتية على الشخص المصاب بمرض دوشين:
*     الجنف (Scoliosis)، وهي حالة تسبب انحناء العمود الفقري.
*         انكماش عضلات الأرجل.
*         مشكلات متعلقة بالدراسة والذاكرة والتركيز.
*         الصداع، والنعاس.
*         مشكلات في التنفس، مثل انقطاع في النفس، وهذه المشكلات غالبًا ما تعزى لبدء إصابة عضلة القلب وعضلات الجهاز التنفسي بالضعف.""",
        imagePath: 'assets/pictures/dmoor/1_doshien.jpeg',
        categoryName: 'الضمور العضلي الدوشين'),
    CategoryModel(
        isSelected: false,
        description: """
ضعف عضلات الوجه (تدلي الجفن، عدم القدرة على الصفير، انخفاض بقدرة الوجه على القيام بالتعابير، التعبير الوجهي المكتئب أو الغاضب، صعوبة نطق حرفي الميم والباء).
ضعف عضلات حزام الكتف (صعوبة العمل عند رفع الذراعين، انحدار الكتف).
ضعف غير متناظر في العضلة ذات الرأسين.
ضعف غير متناظر في العضلة الظنبوبية الأمامية (عضلة الظنبوب)، ما يسبب هبوط القدم.
فقدان غير متناظر للعضلات الصدرية.
فقدان القوة في عضلات البطن (ما يسبب بروز البطن والقَعَس القطني).
ضعف الحجاب الحاجز الذي يؤدي إلى قصور الجهاز التنفسي (يظهر أكثر لدى المرضى الأكبر سناً والأكثر إعاقةَ).
ضعف السمع الحسي العصبي (موجود لدى 50% من الحالات ولكنه يُلاحظ سريريًا في نسبة أقل(.
تغيرات الشبكية الشبيهة بداء كوتس coats’ disease (توسع الشعريات في الشبكية، وذمة البقعة الصفراء، معظم الحالات خفيفة وغير مهمة سريريًا
""",
        imagePath: 'assets/pictures/dmoor/2_elwagh_el3addi.jpg',
        categoryName: 'الوجه العضدى'),
    CategoryModel(
        isSelected: false,
        description: """
2- هو ضعف العضلات البعيدة عن الوركين والكتفين مثل تلك الموجودة في اليدين أو القدمين أو أسفل الذراعين أو أسفل الساقين.
3-يؤثر الاعتلال العضلي البعيد مع ضعف الحبل الصوتي والحلق (البلعوم) على اليدين والساقين والصوت. قد يسبب صعوبة في البلع. يحدث عادة بين سن 35 و 60.
4-يؤثر الاعتلال العضلي القاصي الفنلندي (الظنبوب) على الساقين ، وخاصة العضلات القريبة من قصبة الساق. يظهر عادةً بعد سن الأربعين ، ولا يزال بإمكان معظم الأشخاص المصابين بهذا المرض المشي طوال حياتهم. 
5-قد يعاني الأشخاص الذين يرثون نسختين من الجين المعيب من ضعف شديد يبدأ في مرحلة الطفولة. قد لا يتمكنون من المشي لاحقًا. قد يتأثر قلبهم أيضًا.
6-يسبب اعتلال عضلي ميوشي القاصي ضعفًا يبدأ في عضلات الربلة. يظهر بين سن 15 و 30. بعض الأشخاص الذين يعانون من هذا النوع من الضمور العضلى البعيد قد لا يتمكنون في النهاية من المشي.
7-يؤثر اعتلال عضلي نوناكا القاصي على العضلات القريبة من قصبة الساق أولاً. ثم يؤثر على مجموعات العضلات في الجزء العلوي من الذراع والساق والرقبة. عادة ما تبقى عضلة الفخذ صحية.
8-عادةً ما يصيب اعتلال ويلاندر العضلي البعيد الذراعين أولاً ثم الساقين. يظهر في الأشخاص الذين تتراوح أعمارهم بين 40 و 50 عامًا.
""",
        imagePath: 'assets/pictures/dmoor/3_elwagh_el3addi.jpg',
        categoryName: 'الضمور العضلي البعيد'),
    CategoryModel(
        isSelected: false,
        description: """ أعراض نقص توتر العضلات لدي الرضع:
* تأخر الحركات الاجماليه عند الرضع مثل رفع الرأس، الجلوس،الزحف
* مشاكل في التغذيه مثل صعوبه المص عند الرضاعه
* عضلات مرنه
* الخلع المتكرر للورك والفك والرقبه
* عدم السيطره علي الرأس وهو رضيعاً
* التنفس الضحل.
* (٢) أعراض نقص توتر العضلات للجنين خلال الحمل:
* أنخفاض حركه الجنين في نهايه الحمل 
* نسبه عاليه منهن تصيبن بكثره السائل السلوي
* حبل سري قصير
* وضعيه الجنين غير سليمه
* تشوهات في الاطراف""",
        imagePath: 'assets/pictures/dmoor/4_el5oloki.jpg',
        categoryName: 'الضمور العضلي الخلقي'),
    CategoryModel(
        isSelected: false,
        description:
            """قد يشمل علاج حثل التأتر العضلي عدد من التدابير للحد من المُضاعفات المرافقة للاصابة وخاصة تلك المؤثرة في القلب والرئتين ومنها : - زراعة منظم دقات القلب . - استخدام اجهزة التنفس الصناعي أثناء النوم . - العلاج الوظيفي التأهيلي واستخدام الدعامات وتقويم العظام لدعم وظيفة الساق واليد .""",
        imagePath: 'assets/pictures/dmoor/5_elwatri.jpg',
        categoryName: 'الضمور العضلي الوتري'),
    CategoryModel(
        isSelected: false,
        description:
            """اعتلال وراثي متقدم غالباً ما يُصيب الأطفال في مقتبل عمر المراهقة، ويتميز بأعراض مشابه لتلك التي تظهر في ضمور العضلة الوجهية الكتفية العضديه مع بقاء الحزام الحوضي أكثر المناطق تأثراً في الغالب. سبب حدوثه غير واضح بشكل كامل.

كمصطلح يمكن اعتباره مجموعة من الاختلالات غير المتجانسة التي يزيد عددها عن المئتي اختلال، وتتميز بتشوهات في نمو الغضاريف والعظام ينتج عنها شكل وحجم غريب للهيكل العظمي، بالإضافة لعدم تجانس العظام الطويلة، والعمود الفقري، والرأس.

اعراض الضمور العضلي في حزام الطرف
هذه الاعتلالات تظهر بوضوح على الأطفال المصابين بها في منذ الأيام الاولى للولادة، لكن بعضها قد يتأخر حتى بداية عمر المراهقة.

يلاحظ قصر طول الذراعين وعدم وصولها الى منتصف منطقة الحوض، وقصر الأطراف العلوية والأطراف السفلية وعدم تناسقها مصحوبة بقصر طول الجذع. عدم التناسق هذا يظهر على شكل:

قصر في طول عظم الفخذ أو عظم العضد كما في التقزم (achondroplasia)، ونقص التنسج الغضروفي (hypochondroplasia) وقصر طول عظم الفخذ الخلقي (congenital short femur).
قصر في طول عظم الكعبرة، وعظم الزند، وعظم الساق، وعظم الشظية كما في متلازمة روبينو ومتلازمة راينهاردت بيفر.
قصر في طول عظام المشط والسلاميات كما في خلل التعظم المحيطي.
قصر في عظام الساعد واليد.
قصر في طول الطرف كاملاً كما في حالة عدم تخليق الغضاريف (achondrogenesis) ومتلازمة روبيرت.
قصر في طول الجذع (رقبة قصيرة وصدر صغير و بطن ناتئة) كما في متلازمة موركيو وخلل التنسج المتحول (metatrophic dysplasia).
في بعض الحالات يحدث صعوبة في التنفس نتيجة لتشوه عظام الصدر، أو اختلالات عصبية نتيجة لحدوث خلل في الحبل الشوكي.""",
        imagePath: 'assets/pictures/dmoor/6_3ezam_eltaraf.jpg',
        categoryName: 'الضمور العضلي في حزام الطرف'),
    CategoryModel(
        isSelected: false,
        description: """أعراض الحثل العضلي العيني البلعومي هي 
تدلي الجفن.
ضعف عضلات العين الخارجية.
عسر البلع.
ذات الرئة الاستنشاقية (مضاعفات).
ضعف أطراف داني.
تعتبر الأعراض والعلامات آنفة الذكر أشيع الموجودات المشاهدة، ولكن قد يعاني بعض المرضى في حالات نادرة من أعراض تشمل الجهاز العصبي المحيطي، وهذا يتماشى مع الانخفاض الكبير في عدد الألياف المغمدة بالميالين.

يكون الحثل العضلي شديدًا في الحالات متماثلة الزيجوت، كما تبدأ أعراضه بالظهور في سن باكرة مقارنةً بالحالات متخالفة الزيجوت
""",
        imagePath: 'assets/pictures/dmoor/7_el3aini.jpg',
        categoryName: 'ضمور العضلي العيني البلعومي '),
    CategoryModel(
        isSelected: false,
        description: """اعراض ضمور عضلي بحسب بيكر
-يصيب عادة الاطفال من الذكور بعد العاشرة من العمر -الاعياء -عدم التوازن -ضعف في عضلات الاطراف العلوية و الرقبة -ضعف في عضلات الاطراف السفلية و الحوض مما يسبب : -عدم القدرة على السير و تزداد سوءا مع الوقت -التعرض للوقوع المتكرر -عدم القدرة على المشي خصوصا بعد سن الخامسة والعشرين -ضمور في العضلات -مشاكل في التنفس.و

""",
        imagePath: 'assets/pictures/dmoor/dmoor_type8.jpeg',
        categoryName: 'ضمور بيكر'),
  ];
}
